#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.realfire_link.cloudflare_record.terraform_managed_resource_04ef8770273f24a074905cf94aa0eb81: Refreshing state... [id=04ef8770273f24a074905cf94aa0eb81]
module.realfire_link.cloudflare_record.terraform_managed_resource_2726bfcb3d4468cd0087c2a57d005f6c: Refreshing state... [id=2726bfcb3d4468cd0087c2a57d005f6c]
module.realfire_dev.cloudflare_record.terraform_managed_resource_4aa00e4f7986c4ecff9a6f5a1a6f12bc: Refreshing state... [id=4aa00e4f7986c4ecff9a6f5a1a6f12bc]
module.realfire_dev.cloudflare_record.terraform_managed_resource_59094dbe266e0ec82604fe359036edb0: Refreshing state... [id=59094dbe266e0ec82604fe359036edb0]
module.protectedpii_com.cloudflare_record.dmarc: Refreshing state... [id=dddea226ef92db2c65f2ea2c8e01d0f5]
module.realfire_dev.cloudflare_record.terraform_managed_resource_456bc27d090bc1bccd3ec0247e514feb: Refreshing state... [id=456bc27d090bc1bccd3ec0247e514feb]
module.realfire_au.cloudflare_record.terraform_managed_resource_71ecf873ed39bc95ac289c5fbdd53a80: Refreshing state... [id=71ecf873ed39bc95ac289c5fbdd53a80]
module.realfire_link.cloudflare_record.terraform_managed_resource_edc1472a0262c4b18110a68391c6a080: Refreshing state... [id=edc1472a0262c4b18110a68391c6a080]
module.realfire_link.cloudflare_record.terraform_managed_resource_4f093e0e15b521612f05d72708c92968: Refreshing state... [id=4f093e0e15b521612f05d72708c92968]
module.realfire_dev.cloudflare_record.terraform_managed_resource_a04900f1cff0cc9df186393625e9d629: Refreshing state... [id=a04900f1cff0cc9df186393625e9d629]
module.protectedpii_com.cloudflare_record.mx3: Refreshing state... [id=a80a816ed0424ab0619f3cf4f7ac427e]
module.realfire_network.cloudflare_record.terraform_managed_resource_d48979982bf0ad0d5be5e2c9e6cb6220: Refreshing state... [id=d48979982bf0ad0d5be5e2c9e6cb6220]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_b2c5dd3a2faeda844cfceeff25f5c827: Refreshing state... [id=b2c5dd3a2faeda844cfceeff25f5c827]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_5c5abc0fdccae3cbb41c7396281f3aba: Refreshing state... [id=5c5abc0fdccae3cbb41c7396281f3aba]
module.realfire_au.cloudflare_record.terraform_managed_resource_b5500d4b699a1e57af92ba3ed030c37e: Refreshing state... [id=b5500d4b699a1e57af92ba3ed030c37e]
module.protectedpii_com.cloudflare_record.mx: Refreshing state... [id=a56093eb8b51f6c19093d14a5806be87]
module.realfire_au.cloudflare_record.terraform_managed_resource_b007352f3aab9a5cbf1a2360333cd9e8: Refreshing state... [id=b007352f3aab9a5cbf1a2360333cd9e8]
module.realfire_dev.cloudflare_record.terraform_managed_resource_e20a1ba9cd2b4da5da3a43db02d6ae93: Refreshing state... [id=e20a1ba9cd2b4da5da3a43db02d6ae93]
module.realfire_network.cloudflare_record.terraform_managed_resource_fe8df75f03f61295e0eb9dc36661b090: Refreshing state... [id=fe8df75f03f61295e0eb9dc36661b090]
module.protectedpii_com.cloudflare_record.mx2: Refreshing state... [id=883ca8a7d6e71546e85880cea87f3cd6]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_1b00ada15f8487843dc8e90f51defc59: Refreshing state... [id=1b00ada15f8487843dc8e90f51defc59]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_6910f22baeb25b9122f798ffc168ad21: Refreshing state... [id=6910f22baeb25b9122f798ffc168ad21]
module.protectedpii_com.cloudflare_record.spf: Refreshing state... [id=75f72bfc70ca2cb77a14324603d89793]
module.realfire_au.cloudflare_record.terraform_managed_resource_ac8ab0f6be08bcffce56effa487da6ca: Refreshing state... [id=ac8ab0f6be08bcffce56effa487da6ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.protectedpii_com.cloudflare_email_routing_address.primary will be created
  + resource "cloudflare_email_routing_address" "primary" {
      + account_id = "1d7d6183d5d2ed67e5bc93e444e4113e"
      + created    = (known after apply)
      + email      = "martin@hylandnet.works"
      + id         = (known after apply)
      + modified   = (known after apply)
      + tag        = (known after apply)
      + verified   = (known after apply)
    }

  # module.protectedpii_com.cloudflare_email_routing_catch_all.catch-all will be created
  + resource "cloudflare_email_routing_catch_all" "catch-all" {
      + enabled = true
      + id      = (known after apply)
      + name    = "protectedpii.com catch-all"
      + tag     = (known after apply)
      + zone_id = "25d563c95e0021b9a4f2475d2d470a9e"

      + action {
          + type  = "forward"
          + value = [
              + "martin@hylandnet.works",
            ]
        }

      + matcher {
          + type = "all"
        }
    }

  # module.protectedpii_com.cloudflare_email_routing_settings.email_settings will be created
  + resource "cloudflare_email_routing_settings" "email_settings" {
      + created     = (known after apply)
      + enabled     = true
      + id          = (known after apply)
      + modified    = (known after apply)
      + name        = (known after apply)
      + skip_wizard = (known after apply)
      + status      = (known after apply)
      + tag         = (known after apply)
      + zone_id     = "25d563c95e0021b9a4f2475d2d470a9e"
    }

  # module.protectedpii_com.cloudflare_record.terraform_managed_resource_dddea226ef92db2c65f2ea2c8e01d0f5 has moved to module.protectedpii_com.cloudflare_record.dmarc
    resource "cloudflare_record" "dmarc" {
        id          = "dddea226ef92db2c65f2ea2c8e01d0f5"
        name        = "_dmarc"
        tags        = []
        # (10 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.terraform_managed_resource_a56093eb8b51f6c19093d14a5806be87 has moved to module.protectedpii_com.cloudflare_record.mx
    resource "cloudflare_record" "mx" {
        id          = "a56093eb8b51f6c19093d14a5806be87"
        name        = "protectedpii.com"
        tags        = []
        # (11 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.terraform_managed_resource_883ca8a7d6e71546e85880cea87f3cd6 has moved to module.protectedpii_com.cloudflare_record.mx2
    resource "cloudflare_record" "mx2" {
        id          = "883ca8a7d6e71546e85880cea87f3cd6"
        name        = "protectedpii.com"
        tags        = []
        # (11 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.terraform_managed_resource_a80a816ed0424ab0619f3cf4f7ac427e has moved to module.protectedpii_com.cloudflare_record.mx3
    resource "cloudflare_record" "mx3" {
        id          = "a80a816ed0424ab0619f3cf4f7ac427e"
        name        = "protectedpii.com"
        tags        = []
        # (11 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.terraform_managed_resource_75f72bfc70ca2cb77a14324603d89793 has moved to module.protectedpii_com.cloudflare_record.spf
    resource "cloudflare_record" "spf" {
        id          = "75f72bfc70ca2cb77a14324603d89793"
        name        = "protectedpii.com"
        tags        = []
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RealFireAU, Action: `pull_request`, Workflow: `Terraform Plan`*